content-org/all-posts.org
#+title: All Posts
#+STARTUP: fold

* TODO 《轻松主义》阅读笔记 :@article:ReadingNotes:
:PROPERTIES:
:EXPORT_FILE_NAME: easilism_book_reading_notes
:EXPORT_OPTIONS: toc:2
:END:
Abstract: 本文准备写一写我在阅读《轻松主义》这本书的时候的所思所想。主要是按照《轻松主义》这本书的大纲结构，看到能联系起我之前没能做好的事情，然后在书中这条建议下能够优化成什么样。每节的内容按照这样展开：

1. 章节x，内容y
2. 之前……
3. 如果看完了这本书，再让我回到那个时候，我会……

最后再用自己的话做一个 500 字以内的总结。以轻松起见，我先完成我现在看到的部分往后的内容，以前的内容我之后再补。一切以负担最小为先。
** 轻松主义纲领
** 如何达到“轻松状态”？
** 如何能够“轻松行动”？
*** 前面的内容
*** 设定行动的上下限
这条纲领要求我们：①、不要用『高开低走』的形式去完成任务；②、用设定每次工作的上限的方法来找到轻松节奏；③、设定合理下限，保障进度范围。

开始的时候劲头满满，强迫自己能干多少就干多少，然后后面发现自己感到了疲倦，最后就再也不想接着干这事了。这就是我很多次间歇性踌躇满志的真实写照。我总是这么认为，觉得如果想要真正做到什么事情，而我也应该心甘情愿地让他吞噬，这样才能够把事情推进下去。但是实际上，努力到一定的程度，再向上努力，则反而会适得其反。

举一个例子，那就是我之前想把 Emacs 的 Linux 下面的 Cursor Animation 给整出来，然后连着整了许多天，每天都吞掉了我大量的时间去查看这个问题。然后我找到了关键代码，并且按照我想法改了一下之后发现没有 work，就直接一口气泄，再不想做了。实际上，在做的过程中，我其实还有别的正事要做，做这件事的时候我有一种非常焦虑的感觉。具体来说，我有一种想干呕的感觉，内心烦躁，总想着赶紧结束这件事情好让我做正事，但是又好像被什么力量按在上面，这个力量不停告诉我：“再努力一下，再努力一下，就能把这件事了结了。”

得知了这条纲领，如果让我再来一次，我会安排每天做这件事情的上限为2个小时，下限是看一个函数，或者写至少 200 字的相关的记录（比如说心得什么的）。这样慢慢做，也许就能够在不耽误正事的同时，把这件想做的事情给做出来。

正如本书中说的：
#+begin_quote
当你慢下来，事情会更加平稳。你有时间去观察，去计划，去协调努力。但是如果太慢，你会陷入僵局或者失去势头。这个道理不仅仅在战场上面适用，在生活与工作中同样适用。日常生活充满了复杂性与不确定性，因此我们在做事情的时候需要设置合理的进度范围，并按照这个范围执行。
#+end_quote
** 5 大杠杆，产生“轻松复利”
复利，即作者提倡的“轻松成果”的反面是什么？作者的答案非常明显，是“线性成果”。什么是线性成果？意为我们的努力得到了一个一次性的产出。此时我们每天都从零开始：如果今天没有努力，今天就没有收获。作者举了几个例子来说明：①、员工的工作；②、死记硬背过了考试；③、比如健身和学习，每次都需要努力“让自己去”做。每次从零开始，没有什么东西累积下来，这个问题一直是我所思考的。作者又在此基础上提出了复利：我们只需要付出一次努力，然后这次努力会源源不断地带来成果。比如说：①、决定每天锻炼一次；②、学会基本原理然后在很多地方可以轻松运用；③、每天习惯性地做同一件事情；

*** 学习：深入原理
**** 探究原理，摸索共性
这条纲领要求我们：①、甄别不同的知识的价值：有的知识并不具备持久的价值，而另一些则具备；②、从不同的表象中找到共同的原理，然后使用它 *无数次*

作者举了一个例子，说他曾经连续三天都带了一个披萨回家给老婆；他老婆只有在第一次的时候表现出惊喜，第二次强装惊喜，第三次已经不再惊喜了。他老婆并非不知感恩之人，只是他仅仅注意到了『披萨会使其惊喜』，而没有去找到她如此表现背后的真实原理。应该思考：什么事情是她真正看重的，什么事情是能够让她连续开心超过3天的。这需要预先投入精力，可是一旦找到了，那就可以一次次地应用这个原理。

其实这条纲领与前面的“限定行动的上下限”正是表与里的关系。我们为什么需要设定行动的上下限？因为做成一件事情，需要我们的行动，但是更加重要的事情是我们对这件事情的思考。我们如此需要思考，以至于需要设定行动的上限，来给我们思考的时间与精力。所谓的第一性原理，也是在说这件事情。第一性原理要求我们不要盲从于权威，而凡事都先追问其原因。比如常见的英国卫兵笑话（英国一直在某个楼梯上布置一个卫兵，但是没有人知道为什么。后面查档案发现原来是数百年前这个楼梯刚刚上漆未干，当时安排了一个卫兵提醒来人注意，被一直沿用至今。）就是一个体现。
**** 种下一颗知识树
知识树的意思就是：在获取树叶，也就是具体的知识之前，已经了解基本的原理（树干）。换句话说，这条纲领要求我们：不仅仅是记住零散的、孤立的知识，而是有一个主干，然后将所有的知识全部都安置到我们的框架里面。

实际上，大脑的工作原理也是如此。一些导向成果的神经元会被加固，而没有导向成果的神经元则会被废弃。洞察是在广泛地观察和广泛地联系之中产生的。我想起之前第一次学习高性能计算的过程，就是把知识当作一个个孤立的点来学习。每个案例，比如GEMM、Histogram、Conv，我都把他们当成一个个独立的案例。最多也就当成了一个引入新的优化方法的媒介。这样导致的一个后果就是，我会学了后面忘记前面，知识由于不常常被提取从而枯死了。我试图使用 Anki 来加固我的学习，但是使用 Anki 本身需要一些毅力。于是我的动力越来越不足，最后算是半放弃了。

如果让我再来一次，我会先选择一本更好的教材，至少是中文的。这样能够减少我的一些阅读压力。在学习的时候我经常会困惑的事情其实是关于硬件方面的内容。我对于前面的知识有些跑马观花（或者教材本身并没有讲清楚），于是每次提起硬件有哪些资源，而这个算法由于何原因无法充分利用这些资源云云的时候，我的印象都不深刻。实际上，高性能计算其实就是通过算法更高效地利用硬件资源，调度计算任务来达到更快速的计算。因此如果让我重新来过，我会更加关心硬件的参数与算法对这些资源的利用率，而不是具体的案例中使用的优化算法之类的细节。

EDIT：其实，这也和之前所说的“轻松行动”有关。因为我太想要『弯道超车』，所以就不停地 push 自己。想抓住一切眼前的东西，却从来没有想过这样做的意义。所以说，每天给自己留有余地这件事情，非常有必要。
**** 获取知识，更要创造知识
这条纲领要求我们把没人做的事情做好：它胜过于把别人都在做的事情做精；

前文所说的，获得知识的方法（探究原理、知识树）可以打开一扇机遇之门，而本小节说，创造知识则可以带来源源不断的机遇。
*** 提升：借助分享的力量
把最重要的事情变成最容易的事情，这章讲分享的力量。他说：当我们想要产生深远的影响时，我们就要想办法让我们的听众也成为老师。这个要求其实不简单，首先，我们自己需要懂得这个话题。否则，我们无法以其昏昏，使人昭昭；其次，我们需要抓住要点，让我们的观点能够做到易于传播。然后，这个观点还需要足够有力量，这样众人才会有意愿传播。不过这么抽象地总结其实也是废话。

**** 把听众也变成老师
这条纲领要求我们：如果想要获得影响力，那就让听众也能够去传授你的观点；也就是说，要激发读者的分享欲，实现裂变式传播，这样才会发展得快。其实，这也会让听众：①、更加认同你所传授的内容。②、将你所传授内容更加内化。

**** 把重要的事，变成最容易学的事
这条纲领要求我们：把最重要的事情里面的要点给提炼出来，然后用最简单的，10分钟以内能够讲明白的图文给表示出来，然后尝试讲给别人听。

在这条纲领上作者举了两个例子：①、作者自己在创作《精要主义》后，他也在教授别人如何成为一句精要主义者的同时，自己正成为一名更好的精要主义者。这个例子说明，教别人的过程也是一个快速学习的过程。②、一家公司曾经为了公司各个部门之间的思想统一花了很多时间而无成效：高层制定了一项策略，但是在传授过程里，所有人都有自己的理解；后面有人提出『白板传授』，也就是说，把这个策略简化成了一个10分钟以内可以讲完的白板草图，然后学习者不仅仅要学习这项策略，还要学会如何把它传授给别人。最后效果是，所有人都有了一个共同的理解。这说明，如果想要教些什么，那么就只教简化后的重要的内容，这样就能够获得复利成果。

这章其实就是在讲费曼学习法与实践费曼学习法的 Tips。
*** 自动：重要+高技术；不重要+高时间
这条纲领要求：将一些重要的事情自动化，而将一些不重要的事情花时间手动处理。这听起来有些反直觉，因为我们下意识会觉得重要的事情都是难做的，因此需要手工操作。而不重要的事情都是繁琐的，所以需要自动化的介入。

这条纲领的意思是说：重要的事情难做，但我们总有办法使他变得更加容易一些。自动化就是一个办法：如果我们每次都需要去有意识地做事情，那么这些行动就是一个个孤立事件，每次都需要我们花费同样的精力去处理。但是如果我们把这件事情自动化，那这件事情就会是一个复利事件，我们能够在这件事情上面节约大量的精力。举例来说的话可以放在下面的章节里面：

**** 利用清单
这是一个重要的自动化的例子。说实话在本书提及之前我从没有想过清单也算一种『自动化』，而在听说这个说法后，马上就能够想明白。因为列出清单其实就是在自动化『思考』与『回忆』的过程——我们本来那个时候是会抓耳挠腮地回想，忐忑不安地检查遗漏的，但是只要列出了清单，这一切的过程就被节约下来了。

**** 利用自动化技术提前完成思考
这个例子其实可以用『通过一直在犹豫时去同一家餐厅点同一份菜而节约大量思考的时间』来概括。把一些重要、但是却可以自动化的事情自动化，于是我们便收获了巨大的好处。类比到其它事情，我们还能自动化哪些重要事项呢？总而言之，就是一些重要但是不紧急的事项：

- 比如说体检，复诊，许久之后要交成果的项目等。这些可以通过提前预约好作业时间来自动化。
- 娱乐：每天安排一个小时做愉悦的事情。
- 家庭：一些日常的开销，可以提前规划好，然后定期下单。
**** 总结
本节其实还是那句话：心智负担最小化。人一天能够操心的事情是有限的，而使用一些固定的模式，把我的操心的事情提前缓存好，那我的操心就能够被使用在更加重要的地方了。
*** 信任：高信任=高绩效
这条纲领要求：和高信用的人一起工作，给予他们高信任，然后就能得到高绩效。

从自己的角度来说，思维负担将会很小，若我能把一件事情完全委托给信任的人做。更加重要的事情能够被专注。从环境的角度而言，如果一个团队合作的时候互相信任应该体现在哪些方面？我觉得这种信任首先应该体现在 No Blame 文化，即『对事不对人』。团队成员不会因为害怕自己的能力被怀疑而隐藏自己的错误。
*** 预防：防患于未然
这个纲领要求：治于未病。有些事情做好了，那将来很长的一段时间里面都会节约大量的时间。比如说布线系统排好了，那么将省去大量之后来为杂乱的线材烦恼的心力。有些事情难做，并非是因为他本身难做。而是我们没有去采取一些小行动来让生活变得更加轻松。
** 个人总结
这本书说到底其实只有几个核心的思想，所有的论述都是围绕着这几个观点展开的。
1. 放轻松心态，不要『努力』去做什么事情。
2. 做事情的方法是尽可能地降低心智负担，把需要操心的事情提前操心好、不要一次做太多。
3. 细水长流。
4. 了解原理，注意方法。

这本书不是教我们如何偷懒，而是让重要的事情更加轻松地被完成。
